data '中文''测试'n;
    input id  'trea"t''s'n $  "income'中文"n  "lon'中文"n 'M_货''币'n '出生"日期'n:Date9.;
    format '出生"日期'n NLDate20. 'M_货''币'n NLMNY10.3;
    datalines;
 1    p'中1      166.28    146.98     35.123 08May2017
 2    p'中2      214.42    210.22     54.456 19Apr2016
 3    p'中3      172.46    159.42     33.098 19Dec2016
 5    p'中4      175.41    160.66     37 20Dec2018
 6    p'中5      173.13    169.40     20 21Apr2018
 7    p'中6      181.25    170.94     30 19Dec2018
10    p"中7      239.83    214.48     48 23May2018
11    p'中"8     175.32    162.66     51 29May2018
12    p'中9      227.01    211.06     29 30May2018
14    测试        . . . 23May2015
15 . . . . .
;
run;
